{"name":"navigation-parameters-reference.md","shortName":"navigation-parameters-reference","contents":"<!doctype html>\n<html lang=\"en\">\n  <head>\n    <meta charset=\"utf-8\">\n    <meta name=\"viewport\" content=\"width=device-width, initial-scale=1\">\n  </head>\n  <body>\n    <h1>Navigation parameters reference</h1>\n    <p>You can use the listed parameters and functions to configure your navigation structure. The examples show how to use selected options.</p>\n    <h2>Navigation configuration example</h2>\n    <p>This code sample demonstrates a sample structure with the parameters you can use when configuring navigation for Luigi.</p>\n    <pre><code>Luigi.setConfig({\n  routing: {\n    // uses hash-based navigation if set to true\n    useHashRouting: true,\n    nodeParamPrefix: '~',\n    skipRoutingForUrlPatterns: [/access_token=/, /id_token=/]\n  },\n  // navigation structure and settings\n  navigation: {\n    nodeAccessibilityResolver: function (nodeToCheckPermissionFor, parentNode, currentContext) {},\n  viewGroupSettings: {\n    main: {\n      preloadUrl: 'https://my-site.com/index.html#/preload',\n    },\n    projects: {\n      preloadUrl: 'https://my-site.com/projects.html#/preloading',\n    },\n    envs: {\n      preloadUrl: 'https://my-site.com/environments-details.html#/preload-view',\n    }\n  },\n  nodes: [\n    // STATIC navigation node\n    {\n      pathSegment: 'settings',\n      label: 'Settings',\n      viewUrl: 'https://admin.mydomain.com/settings',\n      viewGroup: 'settingsGroup',\n      // optional\n      children: [node, node, node],\n      hideFromNav: false,\n      isolateView: false,\n      icon: 'settings',\n      testId: 'myTestId'\n      category: {\n        label: 'General',\n        testId: 'myTestId',\n        icon: 'general'\n      }, // OR\n      category: 'General'\n    },\n    // DYNAMIC navigation node\n    {\n      navigationContext: 'contextName',\n      pathSegment: ':projectId',\n      testId: 'myTestId',\n      viewUrl: '/some/path/:projectId',\n      context: {\n        projectId: ':projectId'\n      },\n      children: [node, node, node]\n    },\n    // View groups nodes\n    {\n      viewGroup: 'main',\n      pathSegment: 'overview',\n      label: 'Overview',\n      viewUrl: 'https://my-site.com/index.html#/overview'\n    },\n    {\n      viewGroup: 'main',\n      pathSegment: 'preload',\n      viewUrl: 'https://my-site.com/index.html#/preload'\n    },\n    {\n      viewGroup: 'projects',\n      pathSegment: 'projects',\n      label: 'Projects',\n      viewUrl: 'https://my-site.com/projects.html#/list',\n      children: [\n        {\n          pathSegment: 'preloading',\n          viewUrl: 'https://my-site.com/projects.html#/preloading'\n        }\n      ]\n    },\n    {\n      viewGroup: 'envs',\n      pathSegment: 'create-environment',\n      viewUrl: 'https://my-site.com/environments.html#/create',\n      context: {\n        label: 'Create Environment'\n      }\n    },\n    {\n      viewGroup: 'envs',\n      pathSegment: 'environments',\n      viewUrl: 'https://my-site.com/environments-details.html#/list',\n      children: [\n        {\n          pathSegment: 'preload',\n          viewUrl: 'https://my-site.com/environments-details.html#/preload-view'\n        },\n        {\n          pathSegment: 'env1',\n          viewUrl: 'https://my-site.com/environments-details.html#/details/env1'\n        }\n      ]\n    }\n    ],\n    contextSwitcher: {\n      defaultLabel: 'Select Environment ...',\n      testId: 'myTestId',\n      parentNodePath: '/environments',\n      lazyloadOptions: false,\n      fallbackLabelResolver: (id) => (id.toUpperCase()),\n      options: [{label,pathValue}, {label,pathValue}],\n      actions: [{label,link,position,clickHandler?}]\n    },\n    profile: {\n      logout: {\n        label: 'End session'\n        // icon: \"sys-cancel\",\n        testId: 'myTestId',\n      },\n      items: [\n        {\n          icon: '',\n          testId: 'myTestId',\n          label: 'Luigi in Github',\n          externalLink: {\n            url: 'https://github.com/SAP/luigi',\n            sameWindow: false\n          }\n        },\n        {\n          icon: '',\n          label: 'Project 1',\n          link: '/projects/pr1'\n        }\n      ]\n    },\n    productSwitcher: {\n      label: 'My Products',\n      testId: 'myTestId',\n      icon: 'grid',\n      items: [\n        {\n          icon: '',\n          label: 'Luigi in Github',\n          testId: 'myTestId',\n          externalLink: {\n            url: 'https://github.com/SAP/luigi',\n            sameWindow: false\n          }\n        },\n        {\n          icon: '',\n          label: 'Project 1',\n          testId: 'myTestId',\n          link: '/projects/pr1'\n        }\n      ]\n    },\n  }\n});\n</code></pre>\n    <h2>Routing</h2>\n    <p>You can configure the way Luigi tackles routing in your application in the <strong>Routing</strong> section of the configuration file. For example, you can choose the routing strategy to apply in your application as either hash or path location routing.</p>\n    <ul>\n      <li><strong>useHashRouting</strong> defines either hash-based (<code>url.com/#/yourpath</code>) or path-based (<code>url.com/yourpath</code>) routing.</li>\n      <li><strong>nodeParamPrefix</strong> sets the prefix character when using the <code>LuigiClient.linkManager().withParam()</code> function, which provides a way to simply attach query parameters to the view URL for activities such as sorting and filtering. The URL contains the parameters to allow deep linking. If you want to use a different character prefix, define yours here. The default character is <code>~</code>.</li>\n      <li><strong>skipRoutingForUrlPatterns</strong> defines regex patterns to be skipped by the router when listening for path changes. This parameter is used for excluding <strong>redirect_uri</strong> parameters. Default patterns are <code>[/access_token=/, '/id_token=/]</code>.</li>\n      <li><strong>pageNotFoundHandler</strong> is a function defining custom behavior when the 404 (page not found) error occurs. Luigi handles it by default. Leave its body empty if you have an external 404 handling. This function takes the following parameters:\n        <ul>\n          <li><strong>wrongPath</strong>(string): the path that user tried to navigate to</li>\n          <li><strong>wasAnyPathFitted</strong>(bool): it is true if Luigi managed to fit a valid path which means <strong>wrongPath</strong> was only partially wrong. Otherwise it is false.</li>\n        </ul>\n      </li>\n    </ul>\n    <h2>Node navigation parameters</h2>\n    <p>The node navigation parameters are as follows:</p>\n    <ul>\n      <li>\n        <strong>nodeAccessibilityResolver</strong> receives all values defined in the node configuration. It allows you to define a permission checker function that gets executed on every node. If it returns <code>false</code>, Luigi removes the node and its children from the navigation structure.\n        See <a href=\"https://github.com/SAP/luigi/blob/master/core/examples/luigi-sample-angular/src/luigi-config/extended/navigation.js\">angular navigation.js</a> for an example.\n      </li>\n      <li><strong>defaults.isolateView</strong> renders all views in new frames. This setting overrides the same-domain frame reuse. The <strong>defaults.isolateView</strong> is disabled by default, and you can overwrite it using the <strong>isolateView</strong> value on a single node level.</li>\n      <li><strong>preloadViewGroups</strong>(bool) allows deactivating the default preloading of <a href=\"navigation-configuration.md#view-groups\">view groups</a> iframes.</li>\n      <li><strong>viewGroupsSettings</strong> is an object containing key-object pairs, where the key is the view group name as specified in the node parameters, and the object contains key-value pairs. In each key-value pair, the key is the feature name and the value is the actual setting. The following options are supported:\n        <ul>\n          <li><strong>preloadUrl</strong>(string): needs to be an absolute URL for a node from the view group. It is recommended that you use a dedicated small, visually empty view, which imports Luigi Client and is fine with getting an empty context, for example, without an access token. The <strong>preloadUrl</strong> parameter is also required for view group caching in case you need a view group iframe to refresh whenever you navigate back to it.</li>\n        </ul>\n      </li>\n    </ul>\n    <h2>Node parameters</h2>\n    <p>The node parameters are as follows:</p>\n    <ul>\n      <li><strong>pathSegment</strong> specifies the partial URL of the current segment. <strong>pathSegment</strong> must not contain slashes.\n        <ul>\n          <li>A static settings example reflects <code>luigidomain.test/settings</code>.</li>\n          <li>A dynamic settings example, prefixed with a colon, loads on any other value.</li>\n        </ul>\n      </li>\n      <li><strong>link</strong> is a string which refers to an absolute path in the navigation structure or a relative path to a grandchild of the current path. If this parameter is defined, <strong>pathSegment</strong> is ignored.</li>\n      <li><strong>externalLink</strong> is an object which indicates that the node links to an external URL. If this parameter is defined, <strong>pathSegment</strong> and <strong>link</strong> parameters are ignored. It has the following properties:\n        <ul>\n          <li><strong>sameWindow</strong> defines if the external URL is opened in a new or current tab. The default value for this parameter is <code>false</code>.</li>\n          <li><strong>url</strong> is the external URL that the node leads to.</li>\n        </ul>\n      </li>\n      <li><strong>label</strong> contains the display name of the navigation node.</li>\n      <li><strong>testId</strong> is a string where you can define your own custom <code>testId</code>. If there is nothing specified, it is a combination of the node's pathsegment followed by a dash (if pathsegment exists) and the label written as one word and lower case (e.g. <code>pathsegment_label</code> or <code>label</code>).</li>\n      <li><strong>hideFromNav</strong> shows or hides a navigation node. You can still navigate to the node but it does not show up in the top or left pane.</li>\n      <li><strong>viewUrl</strong> contains the URL or path to a view which renders when you click the navigation node. Use either a full URL or a relative path. This value may consist of variables if you have specified a <strong>navigationContext</strong> with a dynamic <strong>pathSegment</strong>. If <strong>viewUrl</strong> is undefined, Luigi activates the child node specified in <strong>defaultChildNode</strong>. When both <strong>viewUrl</strong> and <strong>defaultChildNode</strong> are undefined, Luigi opens the first child of the current node.</li>\n      <li><strong>navigationContext</strong> contains a named node that is mainly for use in combination with a dynamic <strong>pathSegment</strong> to start navigation from a dynamic node using <code>LuigiClient.linkManager().fromContext('contextname')</code>.</li>\n      <li><strong>context</strong> sends the specified object as context to the view. Use this parameter in combination with the dynamic <strong>pathSegment</strong> to receive the context through the context listeners of <strong>Luigi Client</strong>. This is an alternative to using the dynamic value in the <strong>viewUrl</strong>.</li>\n      <li><strong>defaultChildNode</strong> sets the child node that Luigi activates automatically if the current node has no <strong>viewUrl</strong> defined. Provide <strong>pathSegment</strong> of the child node you want to activate as a string.</li>\n      <li><strong>isolateView</strong> renders the view in a new frame when you enter and leave the node. This setting overrides the same-domain frame re-usage. The <strong>isolateView</strong> is disabled by default.</li>\n      <li><strong>viewGroup</strong> allows you to associate nodes to be rendered in the same iframe, as long as they belong to the same origin. The value of this parameter is considered as the view group id. For further explanations, see <a href=\"navigation-configuration.md#view-groups\">this section</a>.</li>\n      <li><strong>keepSelectedForChildren</strong> focuses the navigation on its current hierarchy, omitting the display of children.</li>\n      <li><strong>loadingIndicator.enabled</strong> shows a loading indicator when switching between micro frontends. If you have a fast micro frontend, you can disable this feature to prevent flickering of the loading indicator. This parameter is enabled by default.</li>\n      <li><strong>loadingIndicator.hideAutomatically</strong> disables the automatic hiding of the loading indicator once the micro frontend is loaded. It is only considered if the loading indicator is enabled. It does not apply if the loading indicator is activated manually with the <code>LuigiClient.uxManager().showLoadingIndicator()</code> function. If the loading indicator is enabled and automatic hiding is disabled, use <code>LuigiClient.uxManager().hideLoadingIndicator()</code> to hide it manually in your micro frontend during the startup. This parameter is enabled by default.</li>\n      <li><strong>viewGroup</strong> defines a group of views in the same domain sharing a common security context. This improves performance through reusing the frame. Use <strong>viewGroup</strong> only for the views that use path routing internally.</li>\n      <li><strong>icon</strong> is the name of an icon, without the <code>sap-icon--</code> prefix. Its source may be <a href=\"https://openui5.hana.ondemand.com/1.40.10/iconExplorer.html\">OpenUI</a> or a custom link (relative or absolute) to an image. The icon is displayed next to the node label in the side navigation or instead of the label in the top navigation.</li>\n      <li><strong>hideSideNav</strong> if set to <code>true</code>, the left navigation disappears when you click the affected node. It is set to <code>false</code> by default.</li>\n      <li><strong>badgeCounter</strong> adds a badge with a number and a label to a node. Nodes that are part of a category show a cumulated number of all badges in this category. <strong>badgeCounter</strong> is only available for top navigation items.\n        <ul>\n          <li><strong>label</strong> is the label of the badge.</li>\n          <li>\n            <strong>count</strong> is a function or asynchronous function that returns a number.\n            Gets updated when you click the navigation. Use <code>Luigi.navigation().updateTopNavigation()</code> in Luigi Core or trigger it in Luigi Client by using the custom message feature.\n          </li>\n        </ul>\n      </li>\n      <li><strong>category</strong> defines a group of views separated with a headline and an icon. You should define at least one node in a group should as an Object with <strong>label</strong> and <strong>icon</strong> properties. For all other nodes, you can set <strong>category</strong> as a string with the <code>label</code> value.\n        <ul>\n          <li><strong>label</strong> is a string that represents the title of the category</li>\n          <li><strong>icon</strong> is the name of an icon, without the <code>sap-icon--</code> prefix. Its source may be <a href=\"https://openui5.hana.ondemand.com/1.40.10/iconExplorer.html\">OpenUI</a> or a custom link (relative or absolute) to an image. The icon is displayed next to the node label in the side navigation or instead of the label in the top navigation. In case you accidentally define different icons in a category group, only the first one is used.</li>\n          <li><strong>collapsible</strong> if set to <code>true</code>, category items are hidden at first. To expand them, click the main category node.</li>\n          <li><strong>testId</strong> is a string where you can define your own custom <code>testId</code>. If nothing is specified, it is the node's label written as one word and lower case (e.g. <code>label</code>).</li>\n        </ul>\n      </li>\n      <li><strong>openNodeInModal</strong> configures the settings of the view which opens in a modal. You can specify the modal's title and size. If you don't specify the title, the node label is used. If there is no node label, the title remains empty. The default size of the modal is <code>l</code>, which means 80%. You can also use <code>m</code> (60%) and <code>s</code> (40%) to set the modal size.<br>Optionally you can set the <strong>openNodeInModal</strong> property to <code>true</code> to use default title and size.\n        <ul>\n          <li><strong>title</strong> modal title. By default, it is the node label. If there is no label, it is left empty</li>\n          <li><strong>size</strong> <strong>(<code>\"l\"</code> | <code>\"m\"</code> | <code>\"s\"</code>)</strong> size of the modal (optional, default <code>\"l\"</code>)</li>\n        </ul>\n      </li>\n      <li><strong>onNodeActivation</strong> is an optional function executed when a request to navigate to the node occurs. As an input parameter, the function receives the node object as described in the configuration. This function can return results synchronously or asynchronously. If the function returns boolean <code>false</code>, the navigation is not triggered, otherwise, navigation renders as usual.</li>\n      <li><strong>clientPermissions.changeCurrentLocale</strong> current locale can be changed from client using the corresponding API if this is set to <code>true</code></li>\n    </ul>\n    <h2>Context switcher</h2>\n    <p>The context switcher is a drop-down list available in the top navigation bar. It allows you to switch between a curated list of navigation elements such as Environments. To do so, add the <strong>contextSwitcher</strong> property to the <strong>navigation</strong> object using the following optional properties:</p>\n    <ul>\n      <li><strong>defaultLabel</strong> specifies the default label that is shown if no context is selected.</li>\n      <li><strong>parentNodePath</strong> specifies the base path, that is prepended to <strong>options[].pathValue</strong>. It must be an absolute path.</li>\n      <li><strong>lazyloadOptions</strong> defines when to fetch <strong>options</strong>. When set to <code>true</code>, loads <strong>options</strong> when you click the context switcher. It doesn't involve any caching. When set to <code>false</code>, loads <strong>options</strong> once the page loads. The default value is <code>true</code>.</li>\n      <li><strong>options</strong> defines the list of context element. Context element properties are:\n        <ul>\n          <li><strong>label</strong> defines the context element label. If not defined, the <strong>pathValue</strong> is passed to <strong>fallbackLabelResolver</strong> to set its value. The default value is <strong>pathValue</strong>, if <strong>fallbackLabelResolver</strong> is not defined.</li>\n          <li><strong>pathValue</strong> defines the context element path that is appended to <strong>parentNodePath</strong> and reflects a <strong>pathSegment</strong>.</li>\n        </ul>\n      </li>\n      <li><strong>actions</strong> defines a list of additional elements that are shown on above or below the context switcher <strong>options</strong>. Each action contains the following parameters:\n        <ul>\n          <li><strong>label</strong> defines the action element label.</li>\n          <li><strong>testId</strong> is a string where you can define your own custom <code>testId</code>. If nothing is specified, it is the node's label written as one word and lower case (e.g. <code>label</code>).</li>\n          <li><strong>position</strong> defines the action element position. Can be <code>top</code> or <code>bottom</code>. The default value is <code>top</code>. This parameter is optional.</li>\n          <li><strong>link</strong> defines an absolute Link to a <strong>node</strong>. This parameter is optional.</li>\n          <li><strong>clickHandler</strong> specifies a function and is executed on click and should return a boolean. If it returns <code>true</code>, <strong>link</strong> is opened afterwards.</li>\n        </ul>\n      </li>\n      <li><strong>fallbackLabelResolver</strong> specifies a function used to fetch the <strong>label</strong> for <strong>options</strong> with no <strong>label</strong> defined. Additionally, it fetches the drop-down label for non-existing <strong>options</strong>.</li>\n    </ul>\n    <h2>Profile</h2>\n    <p>The profile section is a configurable drop-down list available in the top navigation bar. Within the configuration, you can override the logout item content (if authorization is configured) and/or add links to Luigi navigation nodes. To do so, add the <strong>profile</strong> property to the <strong>navigation</strong> object using the following optional properties:</p>\n    <ul>\n      <li><strong>logout</strong> overrides the content of the logout item.\n        <ul>\n          <li><strong>label</strong> overrides the text for the logout item. The default value is \"Sign Out\".</li>\n          <li><strong>testId</strong> is a string where you can define your own custom <code>testId</code>. If nothing is specified, it is the node's label written as one word and lower case (e.g. <code>label</code>).</li>\n          <li><strong>icon</strong> overrides the icon for the logout item. The default value is <a href=\"https://sapui5.hana.ondemand.com/test-resources/sap/m/demokit/iconExplorer/webapp/index.html#/overview/SAP-icons/?tag=logout\">SAP UI5 log icon</a>.</li>\n        </ul>\n      </li>\n      <li><strong>items</strong> is an array of objects, each one being a link to a Luigi navigation node or an external URL. An item can have the following parameters:\n        <ul>\n          <li><strong>label</strong> defines the text for the link.</li>\n          <li><strong>testId</strong> is a string where you can define your own custom <code>testId</code>. If nothing is specified, it is the node's label written as one word and lower case (e.g. <code>label</code>).</li>\n          <li><strong>icon</strong> is the name of an icon from the <a href=\"https://openui5.hana.ondemand.com/1.40.10/iconExplorer.html\">OpenUI</a> or a custom link (relative or absolute) to an image displayed next to the label or instead of it.</li>\n          <li><strong>link</strong> defines an absolute link to a <strong>node</strong>.</li>\n          <li>\n            <strong>externalLink</strong> is an object which indicates that the node links to an external URL. If this parameter is defined, the <strong>link</strong> parameter is ignored. It has the following properties:\n            - <strong>sameWindow</strong> defines if the external URL is opened in the current tab or in a new one. The default value for this parameter is <code>false</code>.\n            - <strong>url</strong> is the external URL that the link leads to.\n            <blockquote>\n              <p><strong>NOTE:</strong> Neither authorization nor profile property are configured if the profile section in the top navigation bar is not visible.</p>\n            </blockquote>\n          </li>\n        </ul>\n      </li>\n    </ul>\n    <h2>Product switcher</h2>\n    <p>The product switcher is a pop-up window available in the top navigation bar. It allows you to switch between the navigation elements displayed in the pop-up. To do so, add the <strong>productSwitcher</strong> property to the <strong>navigation</strong> object using the following optional properties:</p>\n    <ul>\n      <li><strong>label</strong> defines the label of the product switcher. It is displayed as a title attribute on hover in the top navigation and as a headline in the mobile pop-up.</li>\n      <li><strong>testId</strong> is a string where you can define your own custom <code>testId</code>. If nothing is specified, it is the node's label written as one word and lower case (e.g. <code>label</code>).</li>\n      <li><strong>icon</strong> is the name of an icon, without the <code>sap-icon--</code> prefix. Its source may be <a href=\"https://openui5.hana.ondemand.com/1.40.10/iconExplorer.html\">OpenUI</a> or a custom link (relative or absolute) to an image. The icon is displayed without label in the top navigation.</li>\n      <li><strong>items</strong> is an array of objects, each one being a link to a Luigi navigation node or an external URL. An item can have the following parameters:\n        <ul>\n          <li><strong>label</strong> defines the text for the link.</li>\n          <li><strong>testId</strong> is a string where you can define your own custom <code>testId</code>. If nothing is specified, it is the node's label written as one word and lower case (e.g. <code>label</code>).</li>\n          <li><strong>icon</strong> is the name of an icon from the <a href=\"https://openui5.hana.ondemand.com/1.40.10/iconExplorer.html\">OpenUI</a> or a custom link (relative or absolute) to an image displayed next to the label or instead of it.</li>\n          <li><strong>link</strong> defines an absolute link to a <strong>node</strong>.</li>\n          <li><strong>externalLink</strong> is an object which indicates that the node links to an external URL. If this parameter is defined, the <strong>link</strong> parameter is ignored. It has the following properties:\n            <ul>\n              <li><strong>sameWindow</strong> defines if the external URL is opened in the current tab or in a new one. The default value for this parameter is <code>false</code>.</li>\n              <li><strong>url</strong> is the external URL that the link leads to.</li>\n            </ul>\n          </li>\n        </ul>\n      </li>\n    </ul>\n  </body>\n</html>\n"}